console.log("hawii")
console.log("안녕하세염") 
console.log(100)
console.log('hawii'+'java')
console.log(true)

// 표현식 expresson
// 결과가 '값'이 나오는 문장 

// 한개 이상의 표현식이 모여 문장(statement)
// 모든 표현식은 문장이 될수 있다
// (일반적으로) 문장의 끝은 세미콜론 붙인다
// 안붙여도 되지만 관례적으로 붙인다
// 한줄에 여러 문장을 적을 경우, 반드시 세미콜론으로 구분해야 한다
// 마지막 문장은 세미콜론을 붙이지 않아도 문제 안됨.
// 마지막 문장의 결과(값) 가 리턴됩니다
// ex : true; 26; 1001
//   --> 결과 1001

// 조건문(if), 반복문(for) 도 문장입니다.
// 이 경우 마지막 } 뒤에 세미콜론을 붙이지 않습니다.

// 표현식이 모여서 문장을 만들고
// 문장들이 모여서 프로그램을 만듭니다.

